[
    {
        "company": {
            "name": "Ideagen",
            "url": "https://www.ideagen.com",
            "notes": "(acquired Qualtrax March 2021)"
        },
        "positions": [
            {
                "name": "Senior Software Engineer",
                "start": "Jan 2018",
                "end": "Present"
            }
        ],
        "description": "Served as the lead developer for a team of product engineers focused on modernizing quality management applications. Daily activities included development, pairing, mentoring, code reviews, and facilitating agile ceremonies, retrospectives, and post-mortems.",
        "highlights": [
            "Reduced Azure hosting costs by 60%",
            "Increased application deployment frequency from quarterly to weekly",
            "Implemented SSO, SCIM, and JIT user-provisioning features",
            "Strengthened shared engineering principles through regular community activities"
        ]
    },
    {
        "company": {
            "name": "InventureIT",
            "url": "https://www.inventureit.com",
            "notes": ""
        },
        "positions": [
            {
                "name": "Senior Software Engineer",
                "start": "Jan 2016",
                "end": "Jan 2018"
            }
        ],
        "description": "Collaborated with other developers on an agile team to enhance and expand the company's software portfolio for clients in various industries.",
        "highlights": [
            "Architected template for reusable, multi-tenant web applications",
            "Introduced automated testing processes to speed up development time",
            "Automated release process to increase deployment speed and consistency",
            "Streamlined physician workflow using OCR and RFID to increase practice efficiency"
        ]
    },
    {
        "company": {
            "name": "Shaw Industries, Inc.",
            "url": "https://shawinc.com/",
            "notes": ""
        },
        "positions": [
            {
                "name": "Senior Software Engineer",
                "start": "Jan 2013",
                "end": "Jan 2016"
            },
            {
                "name": "Systems Engineer",
                "start": "Dec 2007",
                "end": "Jan 2013"
            }
        ],
        "description": "Worked with other developers in agile teams to improve and expand the company's existing library of manufacturing applications.",
        "highlights": [
            "Developed a patented, robotic manufacturing process",
            "Architected a custom service bus to reduce systems integration development",
            "Led major refactoring of applications to integrate with a new shop floor system",
            "Encouraged technical growth within the group by facilitating lunch-and-learns"
        ]
    }
]